phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/stm32l4-multi.c
/*
 * Phoenix-RTOS
 *
 * STM32L4 multi driver main
 *
 * Copyright 2018, 2020, 2022 Phoenix Systems
 * Author: Aleksander Kaminski, Tomasz Korniluk
 *
 * This file is part of Phoenix-RTOS.
 *
 * %LICENSE%
 */


#include <errno.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdint.h>
#include <sys/threads.h>
#include <sys/msg.h>
#include <sys/pwman.h>
#include <posix/utils.h>

#include <libklog.h>
#include <i2c-msg.h>

#include "common.h"
#include "config.h"

#include "adc.h"
#include "exti.h"
#include "gpio.h"
#include "i2c.h"
#include "rcc.h"
#include "rtc.h"
#include "spi.h"
#include "tty.h"
#include "uart.h"
#include "rng.h"

#if defined(__CPU_STM32L4X6)
#include "flash.h"
#elif defined(__CPU_STM32N6)
#include "ext_flash.h"
#include "pwm_n6.h"
#endif

#if ((MULTIDRV_INTERFACE_THREADS) < 2)
#error "At least two interface threads required"
#endif

#define THREADS_NO       MULTIDRV_INTERFACE_THREADS
#define THREADS_PRIORITY 1
#define STACKSZ          MULTIDRV_STACKSZ


#if (UART1 && TTY1) || (UART2 && TTY2) || (UART3 && TTY3) || \
		(UART4 && TTY4) || (UART5 && TTY5) || (UART6 && TTY6) || \
		(UART7 && TTY7) || (UART8 && TTY8) || (UART9 && TTY9) || \
		(UART10 && TTY10)
#error "Can't use UART as UART and TTY at the same time!"
#endif

#ifndef UART_CONSOLE_USER
#error "UART_CONSOLE_USER not specified"
#endif

#if !(UART_CONSOLE_USER == 1 && (UART1 || TTY1)) && \
		!(UART_CONSOLE_USER == 2 && (UART2 || TTY2)) && \
		!(UART_CONSOLE_USER == 3 && (UART3 || TTY3)) && \
		!(UART_CONSOLE_USER == 4 && (UART4 || TTY4)) && \
		!(UART_CONSOLE_USER == 5 && (UART5 || TTY5)) && \
		!(UART_CONSOLE_USER == 6 && (UART6 || TTY6)) && \
		!(UART_CONSOLE_USER == 7 && (UART7 || TTY7)) && \
		!(UART_CONSOLE_USER == 8 && (UART8 || TTY8)) && \
		!(UART_CONSOLE_USER == 9 && (UART9 || TTY9)) && \
		!(UART_CONSOLE_USER == 10 && (UART10 || TTY10))
#warning "Console enabled on disabled UART/TTY"
#endif

#define CONSOLE_IS_TTY ((UART_CONSOLE_USER == 1 && TTY1) || \
		(UART_CONSOLE_USER == 2 && TTY2) || \
		(UART_CONSOLE_USER == 3 && TTY3) || \
		(UART_CONSOLE_USER == 4 && TTY4) || \
		(UART_CONSOLE_USER == 5 && TTY5) || \
		(UART_CONSOLE_USER == 6 && TTY6) || \
		(UART_CONSOLE_USER == 7 && TTY7) || \
		(UART_CONSOLE_USER == 8 && TTY8) || \
		(UART_CONSOLE_USER == 9 && TTY9) || \
		(UART_CONSOLE_USER == 10 && TTY10))


struct {
	char stack[THREADS_NO - 1][STACKSZ] __attribute__((aligned(8)));

	unsigned int port;
} common;


static void handleMsgMulti(msg_t *msg)
{
	multi_i_t *imsg = (multi_i_t *)msg->i.raw;
	multi_o_t *omsg = (multi_o_t *)msg->o.raw;
	int err = EOK;
	unsigned int t;

	switch (imsg->type) {
		case i2c_get:
			err = i2c_read(imsg->i2c_msg.i2c, imsg->i2c_msg.addr, msg->o.data, msg->o.size);
			break;

		case i2c_getwreg:
			err = i2c_readReg(imsg->i2c_msg.i2c, imsg->i2c_msg.addr, imsg->i2c_msg.reg, msg->o.data, msg->o.size);
			break;

		case i2c_set:
			err = i2c_write(imsg->i2c_msg.i2c, imsg->i2c_msg.addr, msg->i.data, msg->i.size);
			break;

		case i2c_setwreg:
			err = i2c_writeReg(imsg->i2c_msg.i2c, imsg->i2c_msg.addr, imsg->i2c_msg.reg, msg->i.data, msg->i.size);
			break;

		case exti_def:
			err = exti_configure(imsg->exti_def.line, imsg->exti_def.mode, imsg->exti_def.edge);
			break;

		case exti_map:
			err = syscfg_mapexti(imsg->exti_map.line, imsg->exti_map.port);
			break;

		case rtc_setcal:
			rtc_setCalib(imsg->rtc_calib);
			break;

		case rtc_get:
			rtc_getTime(&omsg->rtc_timestamp);
			break;

		case rtc_set:
			rtc_setTime(&imsg->rtc_timestamp);
			break;

		case rtc_setalarm:
			rtc_setAlarm(&imsg->rtc_timestamp);
			break;

		case rtc_getBackup:
			err = rtc_recallBackup(msg->o.data, msg->o.size);
			break;

		case rtc_setBackup:
			err = rtc_storeBackup(msg->i.data, msg->i.size);
			break;

		case adc_get:
			t = 0;
			err = adc_conversion(imsg->adc_get.adcno, imsg->adc_get.channel, &t);
			omsg->adc_valmv = (unsigned short)t;
			break;

		case spi_get:
			err = spi_transaction(imsg->spi_rw.spi, spi_dir_read, imsg->spi_rw.cmd, imsg->spi_rw.addr,
					imsg->spi_rw.flags, msg->o.data, NULL, msg->o.size);
			break;

		case spi_set:
			err = spi_transaction(imsg->spi_rw.spi, spi_dir_write, imsg->spi_rw.cmd, imsg->spi_rw.addr,
					imsg->spi_rw.flags, NULL, msg->i.data, msg->i.size);
			break;

		case spi_rw:
			err = spi_transaction(imsg->spi_rw.spi, spi_dir_readwrite, imsg->spi_rw.cmd, imsg->spi_rw.addr,
					imsg->spi_rw.flags, msg->o.data, msg->i.data, (msg->i.size > msg->o.size) ? msg->o.size : msg->i.size);
			break;

		case spi_def:
			err = spi_configure(imsg->spi_def.spi, imsg->spi_def.mode, imsg->spi_def.bdiv, imsg->spi_def.enable);
			break;

		case gpio_def:
			err = gpio_configPin(imsg->gpio_def.port, imsg->gpio_def.pin, imsg->gpio_def.mode,
					imsg->gpio_def.af, imsg->gpio_def.otype, imsg->gpio_def.ospeed, imsg->gpio_def.pupd);
			break;

		case gpio_get:
			err = gpio_getPort(imsg->gpio_get.port, &t);
			omsg->gpio_get = t;
			break;

		case gpio_set:
			err = gpio_setPort(imsg->gpio_set.port, imsg->gpio_set.mask, imsg->gpio_set.state);
			break;

		case uart_def:
			err = uart_configure(imsg->uart_def.uart, imsg->uart_def.bits, imsg->uart_def.parity,
					imsg->uart_def.baud, imsg->uart_def.enable);
			break;

		case uart_get:
			err = uart_read(imsg->uart_get.uart, msg->o.data, msg->o.size,
					imsg->uart_get.mode, imsg->uart_get.timeout);
			break;

		case uart_set:
			err = uart_write(imsg->uart_set.uart, msg->i.data, msg->i.size);
			break;

		case rng_get:
			err = rng_read(msg->o.data, msg->o.size);
			break;

#if defined(STM32MULTI_HANDLE_FLASH)
		case flash_get:
			err = flash_readData(imsg->flash_addr, msg->o.data, msg->o.size);
			break;

		case flash_set:
			err = flash_writeData(imsg->flash_addr, msg->i.data, msg->i.size);
			break;

		case flash_setRaw:
			err = flash_writeRaw(imsg->flash_addr, msg->i.data, msg->i.size);
			break;

		case flash_erase:
			err = flash_erasePage(imsg->flash_addr);
			break;

		case flash_info:
			flash_getInfo(&omsg->flash_info);
			break;

		case otp_get:
			err = flash_readOtp(imsg->otp_rw.offset, msg->o.data, msg->o.size);
			break;

		case otp_set:
			if (imsg->otp_rw.magic == OTP_WRITE_MAGIC && msg->i.data != NULL) {
				err = flash_writeOtp(imsg->otp_rw.offset, msg->i.data, msg->i.size);
			}
			else {
				err = -EINVAL;
			}
			break;
#endif

#if defined(STM32MULTI_HANDLE_EXTFLASH)
		case extFlash_read:
			err = extFlash_fn_read(imsg->extFlash_op.devNum, imsg->extFlash_op.addr, msg->o.data, msg->o.size);
			break;

		case extFlash_write:
			err = extFlash_fn_write(imsg->extFlash_op.devNum, imsg->extFlash_op.addr, msg->i.data, msg->i.size);
			break;

		case extFlash_erase:
			err = extFlash_fn_erase(imsg->extFlash_op.devNum, imsg->extFlash_op.addr, imsg->extFlash_op.eraseSize);
			break;

		case extFlash_chipErase:
			err = extFlash_fn_chipErase(imsg->extFlash_op.devNum);
			break;

		case extFlash_sync:
			err = extFlash_fn_sync(imsg->extFlash_op.devNum);
			break;

		case extFlash_def:
			err = extFlash_fn_getInfo(imsg->extFlash_op.devNum, &omsg->extFlash_def);
			break;
#endif

#if defined(STM32MULTI_HANDLE_PWM)
		case pwm_def:
			err = pwm_configure(imsg->pwm_def.timer, imsg->pwm_def.prescaler, imsg->pwm_def.top);
			break;
		case pwm_setm:
			err = pwm_set(imsg->pwm_set.timer, imsg->pwm_set.chn, imsg->pwm_set.compare, 0);
			break;
		case pwm_getm:
			uint32_t compare = 0, top = 0;
			err = pwm_get(imsg->pwm_get.timer, imsg->pwm_get.chn, &top, &compare);
			omsg->pwm_get.top = top;
			omsg->pwm_get.compare = compare;
			break;
		case pwm_getfreq:
			omsg->pwm_basefreq = pwm_getBaseFrequency(imsg->pwm_freq.timer);
			break;
		case pwm_distim:
			err = pwm_disableTimer(imsg->pwm_distim.timer);
			break;
		case pwm_dischn:
			err = pwm_disableChannel(imsg->pwm_dischn.timer, imsg->pwm_dischn.chn);
			break;
		case pwm_bitseq:
			err = pwm_setBitSequence(imsg->pwm_bitseq.timer, imsg->pwm_bitseq.chn, imsg->pwm_bitseq.data,
					imsg->pwm_bitseq.nbits, imsg->pwm_bitseq.datasize, imsg->pwm_bitseq.flags);
			break;
		case pwm_bitseq4:
			const uint16_t chn[] = { imsg->pwm_bitseq4.chn[0], imsg->pwm_bitseq4.chn[1], imsg->pwm_bitseq4.chn[2], imsg->pwm_bitseq4.chn[3] };
			const uint16_t val16[] = { imsg->pwm_bitseq4.val16[0], imsg->pwm_bitseq4.val16[1], imsg->pwm_bitseq4.val16[2], imsg->pwm_bitseq4.val16[3] };
			int *rxOutput = ((msg->o.data != NULL) && (msg->o.size == (4 * sizeof(int)))) ? msg->o.data : NULL;
			err = pwm_setBitSequence4(imsg->pwm_bitseq4.timer, chn, val16, imsg->pwm_bitseq4.hcmp, imsg->pwm_bitseq4.lcmp, imsg->pwm_bitseq4.flags, rxOutput);
			break;
#endif
		default:
			err = -EINVAL;
			break;
	}

	msg->o.err = err;
}


static ssize_t console_write(const char *str, size_t len, int mode)
{
#if CONSOLE_IS_TTY
	return tty_log(str, len);
#else
	return uart_write(UART_CONSOLE_USER - 1, str, len);
#endif
}


static ssize_t console_read(char *str, size_t bufflen, int mode)
{
#if CONSOLE_IS_TTY
	return -ENOSYS;
#else
	return uart_read(UART_CONSOLE_USER - 1, str, bufflen, uart_mnormal, 0);
#endif
}


static void handleMsgI2c(msg_t *msg)
{
	i2c_devctl_t *imsg = (i2c_devctl_t *)msg->i.raw;
	int i2cBus = (msg->oid.id & NODE_ID_MSK);
	int err = EOK;

	switch (imsg->i.type) {
		case i2c_devctl_bus_write:
			err = i2c_write(i2cBus, imsg->i.dev_addr, msg->i.data, msg->i.size);
			break;

		case i2c_devctl_bus_read:
			err = i2c_read(i2cBus, imsg->i.dev_addr, msg->o.data, msg->o.size);
			break;

		case i2c_devctl_reg_read:
			err = i2c_readReg(i2cBus, imsg->i.dev_addr, imsg->i.reg_addr, msg->o.data, msg->o.size);
			break;

		default:
			err = -EINVAL;
			break;
	}

	msg->o.err = err;
}


static void handleMsg(msg_t *msg)
{
	switch (msg->oid.id & (~NODE_ID_MSK)) {
		case node_id_multi:
			handleMsgMulti(msg);
			break;

		case node_id_i2c:
			handleMsgI2c(msg);
			break;

		default:
			msg->o.err = -EINVAL;
			break;
	}
}


static void thread(void *arg)
{
	msg_t msg;
	msg_rid_t rid;

	while (1) {
		while (msgRecv(common.port, &msg, &rid) < 0)
			;

		setPriority(msg.priority);

		switch (msg.type) {
			case mtOpen:
			case mtClose:
				msg.o.err = EOK;
				break;

			case mtRead:
				msg.o.err = console_read(msg.o.data, msg.o.size, msg.i.io.mode);
				break;

			case mtWrite:
				msg.o.err = console_write(msg.i.data, msg.i.size, msg.i.io.mode);
				break;

			case mtDevCtl:
				handleMsg(&msg);
				break;

			default:
				msg.o.err = -ENOSYS;
				break;
		}

		msgRespond(common.port, &msg, rid);

		setPriority(THREADS_PRIORITY);
	}
}


static void log_write(const char *buff, size_t len)
{
	(void)console_write(buff, len, 0);
}


#if BUILTIN_DUMMYFS
extern int fs_init(void);
#endif


#if BUILTIN_POSIXSRV
extern int posixsrv_start(void);
#endif


int main(void)
{
	int i;
	oid_t oid;
	setPriority(THREADS_PRIORITY);

	portCreate(&common.port);

#if BUILTIN_DUMMYFS
	fs_init();
#else
	/* Wait for the filesystem */
	while (lookup("/", NULL, &oid) < 0) {
		usleep(10 * 1000);
	}
#endif

	rcc_init();
	exti_init();
	tty_init();
	gpio_init();
	spi_init();

	int ret = adc_init();
	if (ret < 0) {
		printf("multi: Cannot initialize ADC, status %d\n", ret);
	}

	rtc_init();
#if defined(STM32MULTI_HANDLE_FLASH)
	flash_init();
#endif
	i2c_init(common.port);
	uart_init();
	rng_init();
	libklog_init(log_write);

#if BUILTIN_POSIXSRV
	posixsrv_start();
#endif

#if defined(STM32MULTI_HANDLE_PWM)
	pwm_init();
#endif

#if defined(STM32MULTI_HANDLE_EXTFLASH)
	extFlash_fn_init();
#endif

	/* Do this after klog init to keep shell from overtaking klog */

#if CONSOLE_IS_TTY
	tty_createDev();
#endif

	oid.port = common.port;
	oid.id = node_id_multi;

	create_dev(&oid, "multi");

	printf("multidrv: Started\n");

	for (i = 0; i < THREADS_NO - 1; ++i)
		beginthread(thread, THREADS_PRIORITY, common.stack[i], STACKSZ, (void *)i);

	thread((void *)i);

	return 0;
}
